espressif/esp-idf/components/soc/esp32s31/register/soc/io_mux_reg.h
/*
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0 OR MIT
 */

#pragma once
#include "soc/soc.h"

/* The following are the bit fields for PERIPHS_IO_MUX_x_U registers */
/* Output enable in sleep mode */
#define SLP_OE (BIT(0))
#define SLP_OE_M (BIT(0))
#define SLP_OE_V 1
#define SLP_OE_S 0
/* Pin used for wakeup from sleep */
#define SLP_SEL (BIT(1))
#define SLP_SEL_M (BIT(1))
#define SLP_SEL_V 1
#define SLP_SEL_S 1
/* Pulldown enable in sleep mode */
#define SLP_PD (BIT(2))
#define SLP_PD_M (BIT(2))
#define SLP_PD_V 1
#define SLP_PD_S 2
/* Pullup enable in sleep mode */
#define SLP_PU (BIT(3))
#define SLP_PU_M (BIT(3))
#define SLP_PU_V 1
#define SLP_PU_S 3
/* Input enable in sleep mode */
#define SLP_IE (BIT(4))
#define SLP_IE_M (BIT(4))
#define SLP_IE_V 1
#define SLP_IE_S 4
/* Drive strength in sleep mode */
#define SLP_DRV 0x3
#define SLP_DRV_M (SLP_DRV_V << SLP_DRV_S)
#define SLP_DRV_V 0x3
#define SLP_DRV_S 5
/* Pulldown enable */
#define FUN_PD (BIT(7))
#define FUN_PD_M (BIT(7))
#define FUN_PD_V 1
#define FUN_PD_S 7
/* Pullup enable */
#define FUN_PU (BIT(8))
#define FUN_PU_M (BIT(8))
#define FUN_PU_V 1
#define FUN_PU_S 8
/* Input enable */
#define FUN_IE (BIT(9))
#define FUN_IE_M (FUN_IE_V << FUN_IE_S)
#define FUN_IE_V 1
#define FUN_IE_S 9
/* Drive strength */
#define FUN_DRV 0x3
#define FUN_DRV_M (FUN_DRV_V << FUN_DRV_S)
#define FUN_DRV_V 0x3
#define FUN_DRV_S 10
/* Function select (possible values are defined for each pin as FUNC_pinname_function below) */
#define MCU_SEL 0x7
#define MCU_SEL_M (MCU_SEL_V << MCU_SEL_S)
#define MCU_SEL_V 0x7
#define MCU_SEL_S 12

#define PIN_INPUT_ENABLE(PIN_NAME)               SET_PERI_REG_MASK(PIN_NAME,FUN_IE)
#define PIN_INPUT_DISABLE(PIN_NAME)              CLEAR_PERI_REG_MASK(PIN_NAME,FUN_IE)
#define PIN_SET_DRV(PIN_NAME, drv)            REG_SET_FIELD(PIN_NAME, FUN_DRV, (drv));
#define PIN_PULLUP_DIS(PIN_NAME)                 REG_CLR_BIT(PIN_NAME, FUN_PU)
#define PIN_PULLUP_EN(PIN_NAME)                  REG_SET_BIT(PIN_NAME, FUN_PU)
#define PIN_PULLDWN_DIS(PIN_NAME)             REG_CLR_BIT(PIN_NAME, FUN_PD)
#define PIN_PULLDWN_EN(PIN_NAME)              REG_SET_BIT(PIN_NAME, FUN_PD)
#define PIN_FUNC_SELECT(PIN_NAME, FUNC)      REG_SET_FIELD(PIN_NAME, MCU_SEL, FUNC)

#define IO_MUX_GPIO0_REG                    PERIPHS_IO_MUX_U_XTAL32K_HYS_P
#define IO_MUX_GPIO1_REG                    PERIPHS_IO_MUX_U_XTAL32K_HYS_N
#define IO_MUX_GPIO2_REG                    PERIPHS_IO_MUX_U_GPIO2
#define IO_MUX_GPIO3_REG                    PERIPHS_IO_MUX_U_GPIO3
#define IO_MUX_GPIO4_REG                    PERIPHS_IO_MUX_U_GPIO4
#define IO_MUX_GPIO5_REG                    PERIPHS_IO_MUX_U_GPIO5
#define IO_MUX_GPIO6_REG                    PERIPHS_IO_MUX_U_TOUCH_GPIO6
#define IO_MUX_GPIO7_REG                    PERIPHS_IO_MUX_U_TOUCH_GPIO7
#define IO_MUX_GPIO8_REG                    PERIPHS_IO_MUX_U_TOUCH_GPIO8
#define IO_MUX_GPIO9_REG                    PERIPHS_IO_MUX_U_TOUCH_GPIO9
#define IO_MUX_GPIO10_REG                   PERIPHS_IO_MUX_U_TOUCH_GPIO10
#define IO_MUX_GPIO11_REG                   PERIPHS_IO_MUX_U_TOUCH_GPIO11
#define IO_MUX_GPIO12_REG                   PERIPHS_IO_MUX_U_TOUCH_GPIO12
#define IO_MUX_GPIO13_REG                   PERIPHS_IO_MUX_U_TOUCH_GPIO13
#define IO_MUX_GPIO14_REG                   PERIPHS_IO_MUX_U_TOUCH_GPIO14
#define IO_MUX_GPIO15_REG                   PERIPHS_IO_MUX_U_TOUCH_GPIO15
#define IO_MUX_GPIO16_REG                   PERIPHS_IO_MUX_U_TOUCH_GPIO16
#define IO_MUX_GPIO17_REG                   PERIPHS_IO_MUX_U_TOUCH_GPIO17
#define IO_MUX_GPIO18_REG                   PERIPHS_IO_MUX_U_TOUCH_GPIO18
#define IO_MUX_GPIO19_REG                   PERIPHS_IO_MUX_U_TOUCH_GPIO19
#define IO_MUX_GPIO20_REG                   PERIPHS_IO_MUX_U_GPIO20
#define IO_MUX_GPIO21_REG                   PERIPHS_IO_MUX_U_GPIO21
#define IO_MUX_GPIO22_REG                   PERIPHS_IO_MUX_U_GPIO22
#define IO_MUX_GPIO23_REG                   PERIPHS_IO_MUX_U_GPIO23
#define IO_MUX_GPIO24_REG                   PERIPHS_IO_MUX_U_GPIO24
#define IO_MUX_GPIO25_REG                   PERIPHS_IO_MUX_U_GPIO25
#define IO_MUX_GPIO26_REG                   PERIPHS_IO_MUX_U_GPIO26
#define IO_MUX_GPIO27_REG                   PERIPHS_IO_MUX_U_GPIO27
#define IO_MUX_GPIO28_REG                   PERIPHS_IO_MUX_U_GPIO28
#define IO_MUX_GPIO29_REG                   PERIPHS_IO_MUX_U_GPIO29
#define IO_MUX_GPIO30_REG                   PERIPHS_IO_MUX_U_GPIO30
#define IO_MUX_GPIO31_REG                   PERIPHS_IO_MUX_U_GPIO31
#define IO_MUX_GPIO32_REG                   PERIPHS_IO_MUX_U_GPIO32
#define IO_MUX_GPIO33_REG                   PERIPHS_IO_MUX_U_USB_GPIO33
#define IO_MUX_GPIO34_REG                   PERIPHS_IO_MUX_U_USB_GPIO34
#define IO_MUX_GPIO35_REG                   PERIPHS_IO_MUX_U_GPIO35
#define IO_MUX_GPIO36_REG                   PERIPHS_IO_MUX_U_GPIO36
#define IO_MUX_GPIO37_REG                   PERIPHS_IO_MUX_U_GPIO37
#define IO_MUX_GPIO38_REG                   PERIPHS_IO_MUX_U_GPIO38
#define IO_MUX_GPIO39_REG                   PERIPHS_IO_MUX_U_GPIO39
#define IO_MUX_GPIO40_REG                   PERIPHS_IO_MUX_U_GPIO40
#define IO_MUX_GPIO41_REG                   PERIPHS_IO_MUX_U_GPIO41
#define IO_MUX_GPIO42_REG                   PERIPHS_IO_MUX_U_ADC_GPIO42
#define IO_MUX_GPIO43_REG                   PERIPHS_IO_MUX_U_ADC_GPIO43
#define IO_MUX_GPIO44_REG                   PERIPHS_IO_MUX_U_ADC_GPIO44
#define IO_MUX_GPIO45_REG                   PERIPHS_IO_MUX_U_ADC_GPIO45
#define IO_MUX_GPIO46_REG                   PERIPHS_IO_MUX_U_ADC_GPIO46
#define IO_MUX_GPIO47_REG                   PERIPHS_IO_MUX_U_ADC_GPIO47
#define IO_MUX_GPIO48_REG                   PERIPHS_IO_MUX_U_ADC_GPIO48
#define IO_MUX_GPIO49_REG                   PERIPHS_IO_MUX_U_ADC_GPIO49
#define IO_MUX_GPIO50_REG                   PERIPHS_IO_MUX_U_ADC_GPIO50
#define IO_MUX_GPIO51_REG                   PERIPHS_IO_MUX_U_ADC_GPIO51
#define IO_MUX_GPIO52_REG                   PERIPHS_IO_MUX_U_ADC_GPIO52
#define IO_MUX_GPIO53_REG                   PERIPHS_IO_MUX_U_ADC_GPIO53
#define IO_MUX_GPIO54_REG                   PERIPHS_IO_MUX_U_ADC_GPIO54
#define IO_MUX_GPIO55_REG                   PERIPHS_IO_MUX_U_ADC_GPIO55
#define IO_MUX_GPIO56_REG                   PERIPHS_IO_MUX_U_ADC_GPIO56
#define IO_MUX_GPIO57_REG                   PERIPHS_IO_MUX_U_ADC_GPIO57
#define IO_MUX_GPIO58_REG                   PERIPHS_IO_MUX_U_GPIO58
#define IO_MUX_GPIO59_REG                   PERIPHS_IO_MUX_U_GPIO59
#define IO_MUX_GPIO60_REG                   PERIPHS_IO_MUX_U_GPIO60
#define IO_MUX_GPIO61_REG                   PERIPHS_IO_MUX_U_GPIO61
#define IO_MUX_GPIO62_REG                   PERIPHS_IO_MUX_U_GPIO62

#define PIN_FUNC_GPIO								1

#define USB_INT_PHY0_DM_GPIO_NUM     33
#define USB_INT_PHY0_DP_GPIO_NUM     34

#define REG_IO_MUX_BASE                              DR_REG_IO_MUX_BASE

// definitions below are generated from pin_txt.csv
#define PERIPHS_IO_MUX_U_XTAL32K_HYS_P               (REG_IO_MUX_BASE + 0x0)
#define FUNC_XTAL_32K_N_GPIO0_0                                            0
#define FUNC_XTAL_32K_N_GPIO0                                              1

#define PERIPHS_IO_MUX_U_XTAL32K_HYS_N               (REG_IO_MUX_BASE + 0x4)
#define FUNC_XTAL_32K_P_GPIO1_0                                            0
#define FUNC_XTAL_32K_P_GPIO1                                              1

#define PERIPHS_IO_MUX_U_GPIO2                       (REG_IO_MUX_BASE + 0x8)
#define FUNC_GPIO2_GPIO2_0                                                 0
#define FUNC_GPIO2_GPIO2                                                   1
#define FUNC_GPIO2_LCD_DATA19_OUT_PAD                                      3

