espressif/esp-idf/components/soc/esp32s31/register/soc/io_mux_reg.h
#define PERIPHS_IO_MUX_U_GPIO3                       (REG_IO_MUX_BASE + 0xc)
#define FUNC_GPIO3_GPIO3_0                                                 0
#define FUNC_GPIO3_GPIO3                                                   1
#define FUNC_GPIO3_LCD_DATA20_OUT_PAD                                      3

#define PERIPHS_IO_MUX_U_GPIO4                      (REG_IO_MUX_BASE + 0x10)
#define FUNC_GPIO4_GPIO4_0                                                 0
#define FUNC_GPIO4_GPIO4                                                   1
#define FUNC_GPIO4_LCD_DATA21_OUT_PAD                                      3

#define PERIPHS_IO_MUX_U_GPIO5                      (REG_IO_MUX_BASE + 0x14)
#define FUNC_GPIO5_GPIO5_0                                                 0
#define FUNC_GPIO5_GPIO5                                                   1
#define FUNC_GPIO5_LCD_DATA22_OUT_PAD                                      3

#define PERIPHS_IO_MUX_U_TOUCH_GPIO6                (REG_IO_MUX_BASE + 0x18)
#define FUNC_GPIO6_GPIO6_0                                                 0
#define FUNC_GPIO6_GPIO6                                                   1

#define PERIPHS_IO_MUX_U_TOUCH_GPIO7                (REG_IO_MUX_BASE + 0x1c)
#define FUNC_GPIO7_GPIO7_0                                                 0
#define FUNC_GPIO7_GPIO7                                                   1
#define FUNC_GPIO7_LCD_DATA23_OUT_PAD                                      3

#define PERIPHS_IO_MUX_U_TOUCH_GPIO8                (REG_IO_MUX_BASE + 0x20)
#define FUNC_GPIO8_GPIO8_0                                                 0
#define FUNC_GPIO8_GPIO8                                                   1
#define FUNC_GPIO8_GMAC_PHY_TXD0_PAD                                       2
#define FUNC_GPIO8_LCD_DATA0_OUT_PAD                                       3

#define PERIPHS_IO_MUX_U_TOUCH_GPIO9                (REG_IO_MUX_BASE + 0x24)
#define FUNC_GPIO9_SPI2_HOLD_PAD                                           0
#define FUNC_GPIO9_GPIO9                                                   1
#define FUNC_GPIO9_GMAC_PHY_TXD1_PAD                                       2
#define FUNC_GPIO9_LCD_DATA1_OUT_PAD                                       3
#define FUNC_GPIO9_DBG_PSRAM_CK_PAD                                        4

#define PERIPHS_IO_MUX_U_TOUCH_GPIO10               (REG_IO_MUX_BASE + 0x28)
#define FUNC_GPIO10_SPI2_CS_PAD                                            0
#define FUNC_GPIO10_GPIO10                                                 1
#define FUNC_GPIO10_GMAC_PHY_TXD2_PAD                                      2
#define FUNC_GPIO10_LCD_DATA2_OUT_PAD                                      3
#define FUNC_GPIO10_DBG_PSRAM_CS_PAD                                       4

#define PERIPHS_IO_MUX_U_TOUCH_GPIO11               (REG_IO_MUX_BASE + 0x2c)
#define FUNC_GPIO11_SPI2_D_PAD                                             0
#define FUNC_GPIO11_GPIO11                                                 1
#define FUNC_GPIO11_GMAC_PHY_TXD3_PAD                                      2
#define FUNC_GPIO11_LCD_DATA3_OUT_PAD                                      3
#define FUNC_GPIO11_DBG_PSRAM_D_PAD                                        4

#define PERIPHS_IO_MUX_U_TOUCH_GPIO12               (REG_IO_MUX_BASE + 0x30)
#define FUNC_GPIO12_SPI2_CK_PAD                                            0
#define FUNC_GPIO12_GPIO12                                                 1
#define FUNC_GPIO12_GMAC_PHY_TXEN_PAD                                      2
#define FUNC_GPIO12_LCD_DATA4_OUT_PAD                                      3
#define FUNC_GPIO12_DBG_PSRAM_Q_PAD                                        4

#define PERIPHS_IO_MUX_U_TOUCH_GPIO13               (REG_IO_MUX_BASE + 0x34)
#define FUNC_GPIO13_SPI2_Q_PAD                                             0
#define FUNC_GPIO13_GPIO13                                                 1
#define FUNC_GPIO13_GMAC_RMII_CLK_PAD                                      2
#define FUNC_GPIO13_LCD_DATA5_OUT_PAD                                      3
#define FUNC_GPIO13_DBG_PSRAM_WP_PAD                                       4

#define PERIPHS_IO_MUX_U_TOUCH_GPIO14               (REG_IO_MUX_BASE + 0x38)
#define FUNC_GPIO14_SPI2_WP_PAD                                            0
#define FUNC_GPIO14_GPIO14                                                 1
#define FUNC_GPIO14_GMAC_RX_CLK_PAD                                        2
#define FUNC_GPIO14_LCD_DATA6_OUT_PAD                                      3
#define FUNC_GPIO14_DBG_PSRAM_HOLD_PAD                                     4

#define PERIPHS_IO_MUX_U_TOUCH_GPIO15               (REG_IO_MUX_BASE + 0x3c)
#define FUNC_GPIO15_SPI2_IO4_PAD                                           0
#define FUNC_GPIO15_GPIO15                                                 1
#define FUNC_GPIO15_GMAC_PHY_RXDV_PAD                                      2
#define FUNC_GPIO15_LCD_DATA7_OUT_PAD                                      3
#define FUNC_GPIO15_DBG_PSRAM_DQ4_PAD                                      4

#define PERIPHS_IO_MUX_U_TOUCH_GPIO16               (REG_IO_MUX_BASE + 0x40)
#define FUNC_GPIO16_SPI2_IO5_PAD                                           0
#define FUNC_GPIO16_GPIO16                                                 1
#define FUNC_GPIO16_GMAC_PHY_RXD3_PAD                                      2
#define FUNC_GPIO16_LCD_DATA8_OUT_PAD                                      3
#define FUNC_GPIO16_DBG_PSRAM_DQ5_PAD                                      4

#define PERIPHS_IO_MUX_U_TOUCH_GPIO17               (REG_IO_MUX_BASE + 0x44)
#define FUNC_GPIO17_SPI2_IO6_PAD                                           0
#define FUNC_GPIO17_GPIO17                                                 1
#define FUNC_GPIO17_GMAC_PHY_RXD2_PAD                                      2
#define FUNC_GPIO17_LCD_DATA9_OUT_PAD                                      3
#define FUNC_GPIO17_DBG_PSRAM_DQ6_PAD                                      4

#define PERIPHS_IO_MUX_U_TOUCH_GPIO18               (REG_IO_MUX_BASE + 0x48)
#define FUNC_GPIO18_SPI2_IO7_PAD                                           0
#define FUNC_GPIO18_GPIO18                                                 1
#define FUNC_GPIO18_GMAC_PHY_RXD1_PAD                                      2
#define FUNC_GPIO18_LCD_DATA10_OUT_PAD                                     3
#define FUNC_GPIO18_DBG_PSRAM_DQ7_PAD                                      4

#define PERIPHS_IO_MUX_U_TOUCH_GPIO19               (REG_IO_MUX_BASE + 0x4c)
#define FUNC_GPIO19_SPI2_DQS_PAD                                           0
#define FUNC_GPIO19_GPIO19                                                 1
#define FUNC_GPIO19_GMAC_PHY_RXD0_PAD                                      2
#define FUNC_GPIO19_LCD_DATA11_OUT_PAD                                     3
#define FUNC_GPIO19_DBG_PSRAM_DQS_0_PAD                                    4

#define PERIPHS_IO_MUX_U_GPIO20                     (REG_IO_MUX_BASE + 0x50)
#define FUNC_SDIO_DATA0_GPIO20_0                                           0
#define FUNC_SDIO_DATA0_GPIO20                                             1
#define FUNC_SDIO_DATA0_SPI2_CK_PAD                                        2
#define FUNC_SDIO_DATA0_DBG_FLASH_CK_PAD                                   4

