espressif/esp-idf/components/soc/esp32s31/register/soc/io_mux_reg.h
#define PERIPHS_IO_MUX_U_GPIO21                     (REG_IO_MUX_BASE + 0x54)
#define FUNC_SDIO_DATA1_GPIO21_0                                           0
#define FUNC_SDIO_DATA1_GPIO21                                             1
#define FUNC_SDIO_DATA1_SPI2_D_PAD                                         2
#define FUNC_SDIO_DATA1_DBG_FLASH_D_PAD                                    4

#define PERIPHS_IO_MUX_U_GPIO22                     (REG_IO_MUX_BASE + 0x58)
#define FUNC_SDIO_DATA2_GPIO22_0                                           0
#define FUNC_SDIO_DATA2_GPIO22                                             1
#define FUNC_SDIO_DATA2_SPI2_Q_PAD                                         2
#define FUNC_SDIO_DATA2_DBG_FLASH_CS_PAD                                   4

#define PERIPHS_IO_MUX_U_GPIO23                     (REG_IO_MUX_BASE + 0x5c)
#define FUNC_SDIO_DATA3_GPIO23_0                                           0
#define FUNC_SDIO_DATA3_GPIO23                                             1
#define FUNC_SDIO_DATA3_SPI2_CS_PAD                                        2
#define FUNC_SDIO_DATA3_DBG_FLASH_Q_PAD                                    4

#define PERIPHS_IO_MUX_U_GPIO24                     (REG_IO_MUX_BASE + 0x60)
#define FUNC_SDIO_CLK_GPIO24_0                                             0
#define FUNC_SDIO_CLK_GPIO24                                               1
#define FUNC_SDIO_CLK_SPI2_HOLD_PAD                                        2
#define FUNC_SDIO_CLK_DBG_FLASH_WP_PAD                                     4

#define PERIPHS_IO_MUX_U_GPIO25                     (REG_IO_MUX_BASE + 0x64)
#define FUNC_SDIO_CMD_GPIO25_0                                             0
#define FUNC_SDIO_CMD_GPIO25                                               1
#define FUNC_SDIO_CMD_SPI2_WP_PAD                                          2
#define FUNC_SDIO_CMD_DBG_FLASH_HOLD_PAD                                   4

#define PERIPHS_IO_MUX_U_GPIO26                     (REG_IO_MUX_BASE + 0x68)
#define FUNC_SPICS_FLASH_CS_PAD                                            0
#define FUNC_SPICS_GPIO26                                                  1

#define PERIPHS_IO_MUX_U_GPIO27                     (REG_IO_MUX_BASE + 0x6c)
#define FUNC_SPIQ_FLASH_Q_PAD                                              0
#define FUNC_SPIQ_GPIO27                                                   1

#define PERIPHS_IO_MUX_U_GPIO28                     (REG_IO_MUX_BASE + 0x70)
#define FUNC_SPIWP_FLASH_WP_PAD                                            0
#define FUNC_SPIWP_GPIO28                                                  1

#define PERIPHS_IO_MUX_U_GPIO29                     (REG_IO_MUX_BASE + 0x74)
#define FUNC_VDD_SPI_GPIO29_0                                              0
#define FUNC_VDD_SPI_GPIO29                                                1

#define PERIPHS_IO_MUX_U_GPIO30                     (REG_IO_MUX_BASE + 0x78)
#define FUNC_SPIHD_FLASH_HOLD_PAD                                          0
#define FUNC_SPIHD_GPIO30                                                  1

#define PERIPHS_IO_MUX_U_GPIO31                     (REG_IO_MUX_BASE + 0x7c)
#define FUNC_SPICLK_FLASH_CK_PAD                                           0
#define FUNC_SPICLK_GPIO31                                                 1

#define PERIPHS_IO_MUX_U_GPIO32                     (REG_IO_MUX_BASE + 0x80)
#define FUNC_SPID_FLASH_D_PAD                                              0
#define FUNC_SPID_GPIO32                                                   1

#define PERIPHS_IO_MUX_U_USB_GPIO33                 (REG_IO_MUX_BASE + 0x84)
#define FUNC_GPIO33_GPIO33_0                                               0
#define FUNC_GPIO33_GPIO33                                                 1
#define FUNC_GPIO33_LCD_DATA12_OUT_PAD                                     3

#define PERIPHS_IO_MUX_U_USB_GPIO34                 (REG_IO_MUX_BASE + 0x88)
#define FUNC_GPIO34_GPIO34_0                                               0
#define FUNC_GPIO34_GPIO34                                                 1
#define FUNC_GPIO34_LCD_DATA13_OUT_PAD                                     3

#define PERIPHS_IO_MUX_U_GPIO35                     (REG_IO_MUX_BASE + 0x8c)
#define FUNC_GPIO35_GPIO35_0                                               0
#define FUNC_GPIO35_GPIO35                                                 1
#define FUNC_GPIO35_REF_GMAC_CLK_PAD                                       2
#define FUNC_GPIO35_LCD_DATA14_OUT_PAD                                     3
#define FUNC_GPIO35_SD2_CDATA0_PAD                                         4

// Strapping: LDO sel
#define PERIPHS_IO_MUX_U_GPIO36                     (REG_IO_MUX_BASE + 0x90)
#define FUNC_GPIO36_GPIO36_0                                               0
#define FUNC_GPIO36_GPIO36                                                 1
#define FUNC_GPIO36_GMAC_PHY_RXDV_PAD                                      2
#define FUNC_GPIO36_LCD_DATA15_OUT_PAD                                     3
#define FUNC_GPIO36_SD2_CDATA1_PAD                                         4

// Strapping: USB2JTAG select: 1->usb2jtag 0-> pad_jtag
#define PERIPHS_IO_MUX_U_GPIO37                     (REG_IO_MUX_BASE + 0x94)
#define FUNC_GPIO37_GPIO37_0                                               0
#define FUNC_GPIO37_GPIO37                                                 1
#define FUNC_GPIO37_GMAC_PHY_TXEN_PAD                                      2
#define FUNC_GPIO37_LCD_DATA16_OUT_PAD                                     3
#define FUNC_GPIO37_SD2_CDATA2_PAD                                         4

// Strapping: Boot Mode select 0
#define PERIPHS_IO_MUX_U_GPIO38                     (REG_IO_MUX_BASE + 0x98)
#define FUNC_GPIO38_GPIO38_0                                               0
#define FUNC_GPIO38_GPIO38                                                 1
#define FUNC_GPIO38_GMAC_PHY_RXD3_PAD                                      2
#define FUNC_GPIO38_LCD_DATA17_OUT_PAD                                     3
#define FUNC_GPIO38_SD2_CDATA3_PAD                                         4

// Strapping: Boot Mode select 1
#define PERIPHS_IO_MUX_U_GPIO39                     (REG_IO_MUX_BASE + 0x9c)
#define FUNC_GPIO39_GPIO39_0                                               0
#define FUNC_GPIO39_GPIO39                                                 1
#define FUNC_GPIO39_GMAC_PHY_RXD2_PAD                                      2
#define FUNC_GPIO39_LCD_DATA18_OUT_PAD                                     3
#define FUNC_GPIO39_SD2_CCLK_PAD                                           4

