espressif/esp-idf/components/soc/esp32s31/register/soc/io_mux_reg.h
// Strapping: Boot Mode select 2
#define PERIPHS_IO_MUX_U_GPIO40                     (REG_IO_MUX_BASE + 0xa0)
#define FUNC_GPIO40_GPIO40_0                                               0
#define FUNC_GPIO40_GPIO40                                                 1
#define FUNC_GPIO40_GMAC_PHY_RXD1_PAD                                      2
#define FUNC_GPIO40_LCD_PCLK_PAD                                           3
#define FUNC_GPIO40_SD2_CCMD_PAD                                           4

#define PERIPHS_IO_MUX_U_GPIO41                     (REG_IO_MUX_BASE + 0xa4)
#define FUNC_GPIO41_GPIO41_0                                               0
#define FUNC_GPIO41_GPIO41                                                 1
#define FUNC_GPIO41_GMAC_PHY_RXD0_PAD                                      2

#define PERIPHS_IO_MUX_U_ADC_GPIO42                 (REG_IO_MUX_BASE + 0xa8)
#define FUNC_GPIO42_GPIO42_0                                               0
#define FUNC_GPIO42_GPIO42                                                 1
#define FUNC_GPIO42_GMAC_RX_CLK_PAD                                        2

#define PERIPHS_IO_MUX_U_ADC_GPIO43                 (REG_IO_MUX_BASE + 0xac)
#define FUNC_GPIO43_GPIO43_0                                               0
#define FUNC_GPIO43_GPIO43                                                 1
#define FUNC_GPIO43_GMAC_RMII_CLK_PAD                                      2
#define FUNC_GPIO43_LCD_H_ENABLE_PAD                                       3

#define PERIPHS_IO_MUX_U_ADC_GPIO44                 (REG_IO_MUX_BASE + 0xb0)
#define FUNC_GPIO44_GPIO44_0                                               0
#define FUNC_GPIO44_GPIO44                                                 1
#define FUNC_GPIO44_GMAC_PHY_TXD0_PAD                                      2
#define FUNC_GPIO44_LCD_H_SYNC_PAD                                         3

#define PERIPHS_IO_MUX_U_ADC_GPIO45                 (REG_IO_MUX_BASE + 0xb4)
#define FUNC_GPIO45_GPIO45_0                                               0
#define FUNC_GPIO45_GPIO45                                                 1
#define FUNC_GPIO45_GMAC_PHY_TXD1_PAD                                      2
#define FUNC_GPIO45_LCD_V_SYNC_PAD                                         3

#define PERIPHS_IO_MUX_U_ADC_GPIO46                 (REG_IO_MUX_BASE + 0xb8)
#define FUNC_GPIO46_GPIO46_0                                               0
#define FUNC_GPIO46_GPIO46                                                 1
#define FUNC_GPIO46_GMAC_PHY_TXD2_PAD                                      2
#define FUNC_GPIO46_CAM_DATA0_IN_PAD                                       3

#define PERIPHS_IO_MUX_U_ADC_GPIO47                 (REG_IO_MUX_BASE + 0xbc)
#define FUNC_GPIO47_GPIO47_0                                               0
#define FUNC_GPIO47_GPIO47                                                 1
#define FUNC_GPIO47_GMAC_PHY_TXD3_PAD                                      2
#define FUNC_GPIO47_CAM_DATA1_IN_PAD                                       3

#define PERIPHS_IO_MUX_U_ADC_GPIO48                 (REG_IO_MUX_BASE + 0xc0)
#define FUNC_GPIO48_GPIO48_0                                               0
#define FUNC_GPIO48_GPIO48                                                 1
#define FUNC_GPIO48_CAM_DATA2_IN_PAD                                       3

#define PERIPHS_IO_MUX_U_ADC_GPIO49                 (REG_IO_MUX_BASE + 0xc4)
#define FUNC_GPIO49_GPIO49_0                                               0
#define FUNC_GPIO49_GPIO49                                                 1
#define FUNC_GPIO49_CAM_DATA3_IN_PAD                                       3

#define PERIPHS_IO_MUX_U_ADC_GPIO50                 (REG_IO_MUX_BASE + 0xc8)
#define FUNC_GPIO50_GPIO50_0                                               0
#define FUNC_GPIO50_GPIO50                                                 1
#define FUNC_GPIO50_CAM_DATA4_IN_PAD                                       3

#define PERIPHS_IO_MUX_U_ADC_GPIO51                 (REG_IO_MUX_BASE + 0xcc)
#define FUNC_GPIO51_GPIO51_0                                               0
#define FUNC_GPIO51_GPIO51                                                 1
#define FUNC_GPIO51_CAM_DATA5_IN_PAD                                       3

#define PERIPHS_IO_MUX_U_ADC_GPIO52                 (REG_IO_MUX_BASE + 0xd0)
#define FUNC_GPIO52_GPIO52_0                                               0
#define FUNC_GPIO52_GPIO52                                                 1
#define FUNC_GPIO52_SPI2_CS_PAD                                            2
#define FUNC_GPIO52_CAM_DATA6_IN_PAD                                       3

#define PERIPHS_IO_MUX_U_ADC_GPIO53                 (REG_IO_MUX_BASE + 0xd4)
#define FUNC_GPIO53_GPIO53_0                                               0
#define FUNC_GPIO53_GPIO53                                                 1
#define FUNC_GPIO53_SPI2_CK_PAD                                            2
#define FUNC_GPIO53_CAM_DATA7_IN_PAD                                       3

#define PERIPHS_IO_MUX_U_ADC_GPIO54                 (REG_IO_MUX_BASE + 0xd8)
#define FUNC_MTDO_MTDO                                                     0
#define FUNC_MTDO_GPIO54                                                   1
#define FUNC_MTDO_SPI2_D_PAD                                               2
#define FUNC_MTDO_CAM_PCLK_PAD                                             3

#define PERIPHS_IO_MUX_U_ADC_GPIO55                 (REG_IO_MUX_BASE + 0xdc)
#define FUNC_MTCK_MTCK                                                     0
#define FUNC_MTCK_GPIO55                                                   1
#define FUNC_MTCK_SPI2_Q_PAD                                               2
#define FUNC_MTCK_CAM_XCLK_PAD                                             3

#define PERIPHS_IO_MUX_U_ADC_GPIO56                 (REG_IO_MUX_BASE + 0xe0)
#define FUNC_MTDI_MTDI                                                     0
#define FUNC_MTDI_GPIO56                                                   1
#define FUNC_MTDI_SPI2_HOLD_PAD                                            2
#define FUNC_MTDI_CAM_V_SYNC_PAD                                           3

#define PERIPHS_IO_MUX_U_ADC_GPIO57                 (REG_IO_MUX_BASE + 0xe4)
#define FUNC_MTMS_MTMS                                                     0
#define FUNC_MTMS_GPIO57                                                   1
#define FUNC_MTMS_SPI2_WP_PAD                                              2
#define FUNC_MTMS_CAM_H_SYNC_PAD                                           3

#define PERIPHS_IO_MUX_U_GPIO58                     (REG_IO_MUX_BASE + 0xe8)
#define FUNC_GPIO58_UART0_TXD_PAD                                          0
#define FUNC_GPIO58_GPIO58                                                 1

#define PERIPHS_IO_MUX_U_GPIO59                     (REG_IO_MUX_BASE + 0xec)
#define FUNC_GPIO59_UART0_RXD_PAD                                          0
#define FUNC_GPIO59_GPIO59                                                 1

// Strapping: Boot Mode select 3
#define PERIPHS_IO_MUX_U_GPIO60                     (REG_IO_MUX_BASE + 0xf0)
#define FUNC_GPIO60_GPIO60_0                                               0
#define FUNC_GPIO60_GPIO60                                                 1

// Strapping: Boot Mode select 4
#define PERIPHS_IO_MUX_U_GPIO61                     (REG_IO_MUX_BASE + 0xf4)
#define FUNC_GPIO61_GPIO61_0                                               0
#define FUNC_GPIO61_GPIO61                                                 1

#define PERIPHS_IO_MUX_U_GPIO62                     (REG_IO_MUX_BASE + 0xf8)
#define FUNC_GPIO62_GPIO62_0                                               0
#define FUNC_GPIO62_GPIO62                                                 1


#define IO_MUX_DATE_REG          (REG_IO_MUX_BASE + 0x1FC)
/* IO_MUX_REG_DATE : R/W ;bitpos:[27:0] ;default: 28'h2502070 ; */
/*description: Version control register.*/
#define IO_MUX_REG_DATE    0x0FFFFFFF
#define IO_MUX_REG_DATE_M  ((IO_MUX_REG_DATE_V)<<(IO_MUX_REG_DATE_S))
#define IO_MUX_REG_DATE_V  0xFFFFFFF
#define IO_MUX_REG_DATE_S  0
